
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>elasticsearch基础 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="chapter2.1.html" />
    
    
    <link rel="prev" href="../chapter1/section1.3.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../chapter1/section1.html">
            
                <a href="../chapter1/section1.html">
            
                    
                    安装
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../chapter1/section1.1.html">
            
                <a href="../chapter1/section1.1.html">
            
                    
                    linux安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../chapter1/section1.2.html">
            
                <a href="../chapter1/section1.2.html">
            
                    
                    docker安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../chapter1/section1.3.html">
            
                <a href="../chapter1/section1.3.html">
            
                    
                    集群搭建
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="section1.html">
            
                <a href="section1.html">
            
                    
                    elasticsearch基础
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="chapter2.1.html">
            
                <a href="chapter2.1.html">
            
                    
                    基本的增删改查操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="section2.2.html">
            
                <a href="section2.2.html">
            
                    
                    query操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="section2.3.html">
            
                <a href="section2.3.html">
            
                    
                    索引管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="section2.4.html">
            
                <a href="section2.4.html">
            
                    
                    聚合
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../chapter4/section1.html">
            
                <a href="../chapter4/section1.html">
            
                    
                    elasticsearch内部机制
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../chapter3/section1.2.html">
            
                <a href="../chapter3/section1.2.html">
            
                    
                    映射
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../chapter4/chapter4.1.html">
            
                <a href="../chapter4/chapter4.1.html">
            
                    
                    倒排索引
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="../chapter3/section1.3.html">
            
                <a href="../chapter3/section1.3.html">
            
                    
                    复合字段
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.4" data-path="../chapter3/section1.4.html">
            
                <a href="../chapter3/section1.4.html">
            
                    
                    分布式搜索
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="../chapter3/section1.html">
            
                <a href="../chapter3/section1.html">
            
                    
                    logstash实践
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="../chapter3/section1.1.html">
            
                <a href="../chapter3/section1.1.html">
            
                    
                    logstash简介
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >elasticsearch基础</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="elasticsearch&#x57FA;&#x7840;">elasticsearch&#x57FA;&#x7840;</h1>
<p>Elasticsearch&#x6709;&#x51E0;&#x4E2A;&#x6838;&#x5FC3;&#x6982;&#x5FF5;&#x3002;&#x5F00;&#x59CB;&#x5B66;&#x4E60;Elasticsearch&#x4E4B;&#x524D;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x6982;&#x5FF5;&#x4F1A;&#x5BF9;&#x6574;&#x4E2A;&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x6709;&#x5F88;&#x5927;&#x7684;&#x5E2E;&#x52A9;&#x3002;</p>
<h2 id="&#x63A5;&#x8FD1;&#x5B9E;&#x65F6;&#xFF08;nrt&#xFF09;">&#x63A5;&#x8FD1;&#x5B9E;&#x65F6;&#xFF08;NRT&#xFF09;</h2>
<p>Elasticsearch &#x662F;&#x4E00;&#x4E2A;&#x63A5;&#x8FD1;&#x5B9E;&#x65F6;&#x7684;&#x641C;&#x7D22;&#x5E73;&#x53F0;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x4ECE;&#x7D22;&#x5F15;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#x76F4;&#x5230;&#x8FD9;&#x4E2A;&#x6587;&#x6863;&#x80FD;&#x591F;&#x88AB;&#x641C;&#x7D22;&#x5230;&#x6709;&#x4E00;&#x4E2A;&#x5F88;&#x5C0F;&#x7684;&#x5EF6;&#x8FDF;&#xFF08;&#x901A;&#x5E38;&#x662F; 1 &#x79D2;&#xFF09;&#x3002;</p>
<h2 id="&#x96C6;&#x7FA4;&#xFF08;cluster&#xFF09;">&#x96C6;&#x7FA4;&#xFF08;cluster&#xFF09;</h2>
<ul>
<li><p>&#x4E00;&#x4E2A;&#x96C6;&#x7FA4;&#x5C31;&#x662F;&#x7531;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x7EC4;&#x7EC7;&#x5728;&#x4E00;&#x8D77;&#xFF0C; &#x5B83;&#x4EEC;&#x5171;&#x540C;&#x6301;&#x6709;&#x4F60;&#x5168;&#x90E8;&#x7684;&#x6570;&#x636E;&#xFF0C; &#x5E76;&#x4E00;&#x8D77;&#x63D0;&#x4F9B;&#x7D22;&#x5F15;&#x548C;&#x641C;&#x7D22;&#x529F;&#x80FD;&#x3002;</p>
</li>
<li><p>&#x4E00;&#x4E2A;&#x96C6;&#x7FA4;&#x7531;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x540D;&#x5B57;&#x6807;&#x8BC6;&#xFF0C; &#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x9ED8;&#x8BA4;&#x5C31;&#x662F;<code>elasticsearch</code>&#x3002; &#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x5F88;&#x91CD;&#x8981;&#xFF0C; &#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x6307;&#x5B9A;&#x67D0;&#x4E2A;&#x96C6;&#x7FA4;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x6765;&#x52A0;&#x5165;&#x8FD9;&#x4E2A;&#x96C6;&#x7FA4;&#x3002;&#x5728;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x663E;&#x5F0F;&#x5730;&#x8BBE;&#x5B9A;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x662F;&#x4E00;&#x4E2A;&#x597D;&#x4E60;&#x60EF;&#xFF0C;&#x4F46;&#x662F;&#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x503C;&#x6765;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;/&#x5F00;&#x53D1;&#x4E5F;&#x662F;&#x4E0D;&#x9519;&#x7684;&#x3002;</p>
</li>
</ul>
<h2 id="&#x8282;&#x70B9;&#xFF08;node&#xFF09;">&#x8282;&#x70B9;&#xFF08;node&#xFF09;</h2>
<p>&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x662F;&#x4F60;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4F5C;&#x4E3A;&#x96C6;&#x7FA4;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5B83;&#x5B58;&#x50A8;&#x4F60;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x53C2;&#x4E0E;&#x96C6;&#x7FA4;&#x7684;&#x7D22;&#x5F15;&#x548C;&#x641C;&#x7D22;&#x529F;&#x80FD;&#x3002; &#x548C;&#x96C6;&#x7FA4;&#x7C7B;&#x4F3C;&#xFF0C; &#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4E5F;&#x662F;&#x7531;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#x6765;&#x6807;&#x8BC6;&#x7684;&#xFF0C; &#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C; &#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x662F;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x7684;<code>Marvel</code>&#x89D2;&#x8272;&#x7684;&#x540D;&#x5B57;&#xFF0C;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x4F1A;&#x5728;&#x8282;&#x70B9;&#x542F;&#x52A8;&#x65F6;&#x5206;&#x914D;&#x7ED9;&#x5B83;&#x3002;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x5BF9;&#x4E8E;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#x6765;&#x8BF4;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x8FD9;&#x4E2A;&#x7BA1;&#x7406;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4F60;&#x4F1A;&#x53BB;&#x786E;&#x5B9A;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x54EA;&#x4E9B; &#x670D;&#x52A1;&#x5668;&#x5BF9;&#x5E94;&#x4E8E;Elasticsearch&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x54EA;&#x4E9B;&#x8282;&#x70B9;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x914D;&#x7F6E;&#x96C6;&#x7FA4;&#x540D;&#x79F0;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x6307;&#x5B9A;&#x7684;&#x96C6;&#x7FA4;&#x3002; &#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x4F1A;&#x88AB;&#x5B89;&#x6392;&#x52A0;&#x5165;&#x5230;&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x201C;elasticsearch&#x201D;&#x7684;&#x96C6;&#x7FA4;&#x4E2D;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x5728;&#x4F60;&#x7684;&#x7F51;&#x7EDC;&#x4E2D;&#x542F;&#x52A8;&#x4E86;&#x82E5;&#x5E72;&#x4E2A;&#x8282;&#x70B9;&#xFF0C; &#x5E76;&#x5047;&#x5B9A;&#x5B83;&#x4EEC;&#x80FD;&#x591F;&#x76F8;&#x4E92;&#x53D1;&#x73B0;&#x5F7C;&#x6B64;&#xFF0C;&#x5B83;&#x4EEC;&#x5C06;&#x4F1A;&#x81EA;&#x52A8;&#x5730;&#x5F62;&#x6210;&#x5E76;&#x52A0;&#x5165;&#x5230;&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x201C;elasticsearch&#x201D; &#x7684;&#x96C6;&#x7FA4;&#x4E2D;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x4E2A;&#x96C6;&#x7FA4;&#x91CC;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x4EFB;&#x610F;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x524D;&#x4F60;&#x7684;&#x7F51;&#x7EDC;&#x4E2D;&#x6CA1;&#x6709;&#x8FD0;&#x884C;&#x4EFB;&#x4F55;Elasticsearch&#x8282;&#x70B9;&#xFF0C;&#x8FD9;&#x65F6;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x4F1A;&#x9ED8;&#x8BA4;&#x521B;&#x5EFA;&#x5E76;&#x52A0;&#x5165;&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x201C;elasticsearch&#x201D;&#x7684;&#x5355;&#x8282;&#x70B9;&#x96C6;&#x7FA4;&#x3002;</p>
<p>&#x5728;Elasticsearch&#x4E2D;&#xFF0C;&#x6587;&#x6863;&#x5F52;&#x5C5E;&#x4E8E;&#x4E00;&#x79CD;<strong>&#x7C7B;&#x578B;(type)</strong>,&#x800C;&#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x5B58;&#x5728;&#x4E8E;<strong>&#x7D22;&#x5F15;(index)</strong>&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x753B;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x5BF9;&#x6BD4;&#x56FE;&#x6765;&#x7C7B;&#x6BD4;&#x4F20;&#x7EDF;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#xFF1A;</p>
<pre><code>Relational DB -&gt; Databases -&gt; Tables -&gt; Rows -&gt; Columns
Elasticsearch -&gt; Indices   -&gt; Types  -&gt; Documents -&gt; Fields
</code></pre><h2 id="&#x7D22;&#x5F15;&#xFF08;index&#xFF09;">&#x7D22;&#x5F15;&#xFF08;index&#xFF09;</h2>
<p>&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x76F8;&#x4F3C;&#x7279;&#x5F81;&#x7684;&#x6587;&#x6863;&#x7684;&#x96C6;&#x5408;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6709;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x6570;&#x636E;&#x7684;&#x7D22;&#x5F15;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x76EE;&#x5F55;&#x7684;&#x7D22;&#x5F15;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x8BA2;&#x5355;&#x6570;&#x636E;&#x7684;&#x7D22;&#x5F15;&#x3002;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x7531;&#x4E00;&#x4E2A;&#x540D;&#x5B57;&#x6765; &#x6807;&#x8BC6;&#xFF08;&#x5FC5;&#x987B;&#x5168;&#x90E8;&#x662F;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;&#x7684;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x5F53;&#x6211;&#x4EEC;&#x8981;&#x5BF9;&#x8FD9;&#x4E2A;&#x7D22;&#x5F15;&#x4E2D;&#x7684;&#x6587;&#x6863;&#x8FDB;&#x884C;&#x7D22;&#x5F15;&#x3001;&#x641C;&#x7D22;&#x3001;&#x66F4;&#x65B0;&#x548C;&#x5220;&#x9664;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x90FD;&#x8981;&#x4F7F;&#x7528;&#x5230;&#x8FD9;&#x4E2A;&#x540D;&#x5B57;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x96C6;&#x7FA4;&#x4E2D;&#xFF0C;&#x4F60;&#x80FD;&#x591F;&#x521B;&#x5EFA;&#x4EFB;&#x610F;&#x591A;&#x4E2A;&#x7D22;&#x5F15;&#x3002;</p>
<h2 id="&#x7C7B;&#x578B;&#xFF08;type&#xFF09;">&#x7C7B;&#x578B;&#xFF08;type&#xFF09;</h2>
<p>&#x5728;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x79CD;&#x6216;&#x591A;&#x79CD;&#x7C7B;&#x578B;&#x3002;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x662F;&#x4F60;&#x7684;&#x7D22;&#x5F15;&#x7684;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x4E0A;&#x7684;&#x5206;&#x7C7B;/&#x5206;&#x533A;&#xFF0C;&#x5176;&#x8BED;&#x4E49;&#x5B8C;&#x5168;&#x7531;&#x4F60;&#x6765;&#x5B9A;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x4F1A;&#x4E3A;&#x5177;&#x6709;&#x4E00;&#x7EC4;&#x76F8;&#x540C;&#x5B57;&#x6BB5;&#x7684;&#x6587;&#x6863;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x3002;&#x6BD4;&#x5982;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x4F60;&#x8FD0;&#x8425;&#x4E00;&#x4E2A;&#x535A;&#x5BA2;&#x5E73;&#x53F0; &#x5E76;&#x4E14;&#x5C06;&#x4F60;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5230;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x4E2D;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x7D22;&#x5F15;&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x4E3A;&#x7528;&#x6237;&#x6570;&#x636E;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#xFF0C;&#x4E3A;&#x535A;&#x5BA2;&#x6570;&#x636E;&#x5B9A;&#x4E49;&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#xFF0C;&#x5F53;&#x7136;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4E3A;&#x8BC4;&#x8BBA;&#x6570;&#x636E;&#x5B9A;&#x4E49;&#x53E6;&#x4E00;&#x4E2A;&#x7C7B;&#x578B;&#x3002;</p>
<h2 id="&#x6587;&#x6863;&#xFF08;document&#xFF09;">&#x6587;&#x6863;&#xFF08;document&#xFF09;</h2>
<p>&#x4E00;&#x4E2A;&#x6587;&#x6863;&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x88AB;&#x7D22;&#x5F15;&#x7684;&#x57FA;&#x7840;&#x4FE1;&#x606F;&#x5355;&#x5143;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x67D0;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7684;&#x6587;&#x6863;&#x3001;&#x67D0;&#x4E00;&#x4E2A;&#x4EA7;&#x54C1;&#x7684;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#x3001;&#x67D0;&#x4E2A;&#x8BA2;&#x5355;&#x7684;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#x3002;&#x6587;&#x6863;&#x4EE5;JSON&#x683C;&#x5F0F;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x800C;JSON&#x662F;&#x4E00;&#x4E2A;&#x5230;&#x5904;&#x5B58;&#x5728;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x6570;&#x636E;&#x4EA4;&#x4E92;&#x683C;&#x5F0F;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x4E2A;index/type&#x91CC;&#x9762;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x4EFB;&#x610F;&#x591A;&#x7684;&#x6587;&#x6863;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#x7269;&#x7406;&#x4E0A;&#x5B58;&#x5728;&#x4E8E;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x4E4B;&#x4E2D;&#xFF0C;&#x4F46;&#x6587;&#x6863;&#x5FC5;&#x987B;&#x88AB;&#x7D22;&#x5F15;/&#x8D4B;&#x4E88;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x7684;type&#x3002;</p>
<p>&#x5E94;&#x7528;&#x4E2D;&#x7684;&#x5BF9;&#x8C61;&#x5F88;&#x5C11;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x7684;&#x952E;&#x503C;&#x5217;&#x8868;&#xFF0C;&#x66F4;&#x591A;&#x65F6;&#x5019;&#x5B83;&#x62E5;&#x6709;&#x590D;&#x6742;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x6BD4;&#x5982;&#x5305;&#x542B;&#x65E5;&#x671F;&#x3001;&#x5730;&#x7406;&#x4F4D;&#x7F6E;&#x3001;&#x53E6;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x6216;&#x8005;&#x6570;&#x7EC4;&#x3002;</p>
<p>&#x603B;&#x6709;&#x4E00;&#x5929;&#x4F60;&#x4F1A;&#x60F3;&#x5230;&#x628A;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x5B58;&#x50A8;&#x5230;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;&#x5C06;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x4FDD;&#x5B58;&#x5230;&#x7531;&#x884C;&#x548C;&#x5217;&#x7EC4;&#x6210;&#x7684;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x662F;&#x628A;&#x4E00;&#x4E2A;&#x4E30;&#x5BCC;&#xFF0C;&#x4FE1;&#x606F;&#x8868;&#x73B0;&#x529B;&#x5F3A;&#x7684;&#x5BF9;&#x8C61;&#x62C6;&#x6563;&#x4E86;&#x653E;&#x5165;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5927;&#x7684;&#x8868;&#x683C;&#x4E2D;&#xFF1A;&#x4F60;&#x4E0D;&#x5F97;&#x4E0D;&#x62C6;&#x6563;&#x5BF9;&#x8C61;&#x4EE5;&#x9002;&#x5E94;&#x8868;&#x6A21;&#x5F0F;&#xFF08;&#x901A;&#x5E38;&#x4E00;&#x5217;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x53C8;&#x4E0D;&#x5F97;&#x4E0D;&#x5728;&#x67E5;&#x8BE2;&#x7684;&#x65F6;&#x5019;&#x91CD;&#x5EFA;&#x5B83;&#x4EEC;&#x3002;</p>
<p>Elasticsearch&#x662F;<strong>&#x9762;&#x5411;&#x6587;&#x6863;(document oriented)</strong>&#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x6574;&#x4E2A;&#x5BF9;&#x8C61;&#x6216;<strong>&#x6587;&#x6863;(document)</strong>&#x3002;&#x7136;&#x800C;&#x5B83;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x5B58;&#x50A8;&#xFF0C;&#x8FD8;&#x4F1A;<strong>&#x7D22;&#x5F15;(index)</strong>&#x6BCF;&#x4E2A;&#x6587;&#x6863;&#x7684;&#x5185;&#x5BB9;&#x4F7F;&#x4E4B;&#x53EF;&#x4EE5;&#x88AB;&#x641C;&#x7D22;&#x3002;&#x5728;Elasticsearch&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5BF9;&#x6587;&#x6863;&#xFF08;&#x800C;&#x975E;&#x6210;&#x884C;&#x6210;&#x5217;&#x7684;&#x6570;&#x636E;&#xFF09;&#x8FDB;&#x884C;&#x7D22;&#x5F15;&#x3001;&#x641C;&#x7D22;&#x3001;&#x6392;&#x5E8F;&#x3001;&#x8FC7;&#x6EE4;&#x3002;&#x8FD9;&#x79CD;&#x7406;&#x89E3;&#x6570;&#x636E;&#x7684;&#x65B9;&#x5F0F;&#x4E0E;&#x4EE5;&#x5F80;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;Elasticsearch&#x80FD;&#x591F;&#x6267;&#x884C;&#x590D;&#x6742;&#x7684;&#x5168;&#x6587;&#x641C;&#x7D22;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x3002;</p>
<h3 id="&#x300C;&#x7D22;&#x5F15;&#x300D;&#x542B;&#x4E49;&#x7684;&#x533A;&#x5206;">&#x300C;&#x7D22;&#x5F15;&#x300D;&#x542B;&#x4E49;&#x7684;&#x533A;&#x5206;</h3>
<p>&#x4F60;&#x53EF;&#x80FD;&#x5DF2;&#x7ECF;&#x6CE8;&#x610F;&#x5230;<strong>&#x7D22;&#x5F15;(index)</strong>&#x8FD9;&#x4E2A;&#x8BCD;&#x5728;Elasticsearch&#x4E2D;&#x6709;&#x7740;&#x4E0D;&#x540C;&#x7684;&#x542B;&#x4E49;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x5FC5;&#x8981;&#x5728;&#x6B64;&#x505A;&#x4E00;&#x4E0B;&#x533A;&#x5206;:</p>
<ul>
<li>&#x7D22;&#x5F15;&#xFF08;&#x540D;&#x8BCD;&#xFF09; &#x5982;&#x4E0A;&#x6587;&#x6240;&#x8FF0;&#xFF0C;&#x4E00;&#x4E2A;<strong>&#x7D22;&#x5F15;(index)</strong>&#x5C31;&#x50CF;&#x662F;&#x4F20;&#x7EDF;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;<strong>&#x6570;&#x636E;&#x5E93;</strong>&#xFF0C;&#x5B83;&#x662F;&#x76F8;&#x5173;&#x6587;&#x6863;&#x5B58;&#x50A8;&#x7684;&#x5730;&#x65B9;&#xFF0C;index&#x7684;&#x590D;&#x6570;&#x662F;<strong>indices</strong> &#x6216;<strong>indexes</strong>&#x3002;</li>
<li>&#x7D22;&#x5F15;&#xFF08;&#x52A8;&#x8BCD;&#xFF09; <strong>&#x300C;&#x7D22;&#x5F15;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#x300D;</strong>&#x8868;&#x793A;&#x628A;&#x4E00;&#x4E2A;&#x6587;&#x6863;&#x5B58;&#x50A8;&#x5230;<strong>&#x7D22;&#x5F15;&#xFF08;&#x540D;&#x8BCD;&#xFF09;</strong>&#x91CC;&#xFF0C;&#x4EE5;&#x4FBF;&#x5B83;&#x53EF;&#x4EE5;&#x88AB;&#x68C0;&#x7D22;&#x6216;&#x8005;&#x67E5;&#x8BE2;&#x3002;&#x8FD9;&#x5F88;&#x50CF;SQL&#x4E2D;&#x7684;<code>INSERT</code>&#x5173;&#x952E;&#x5B57;&#xFF0C;&#x5DEE;&#x522B;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6587;&#x6863;&#x5DF2;&#x7ECF;&#x5B58;&#x5728;&#xFF0C;&#x65B0;&#x7684;&#x6587;&#x6863;&#x5C06;&#x8986;&#x76D6;&#x65E7;&#x7684;&#x6587;&#x6863;&#x3002;</li>
<li>&#x5012;&#x6392;&#x7D22;&#x5F15;,  &#x4F20;&#x7EDF;&#x6570;&#x636E;&#x5E93;&#x4E3A;&#x7279;&#x5B9A;&#x5217;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#xFF0C;&#x4F8B;&#x5982;B-Tree&#x7D22;&#x5F15;&#x6765;&#x52A0;&#x901F;&#x68C0;&#x7D22;&#x3002;Elasticsearch&#x548C;Lucene&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x53EB;&#x505A;<strong>&#x5012;&#x6392;&#x7D22;&#x5F15;(inverted index)</strong>&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x8FBE;&#x5230;&#x76F8;&#x540C;&#x76EE;&#x7684;&#x3002;</li>
</ul>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6587;&#x6863;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x5B57;&#x6BB5;&#x90FD;&#x4F1A;&#x88AB;<strong>&#x7D22;&#x5F15;</strong>&#xFF08;&#x62E5;&#x6709;&#x4E00;&#x4E2A;&#x5012;&#x6392;&#x7D22;&#x5F15;&#xFF09;&#xFF0C;&#x53EA;&#x6709;&#x8FD9;&#x6837;&#x4ED6;&#x4EEC;&#x624D;&#x662F;&#x53EF;&#x88AB;&#x641C;&#x7D22;&#x7684;&#x3002;</p>
<h2 id="&#x5206;&#x7247;&#x548C;&#x590D;&#x5236;&#xFF08;shards-and-replicas&#xFF09;">&#x5206;&#x7247;&#x548C;&#x590D;&#x5236;&#xFF08;shards and replicas&#xFF09;</h2>
<p>&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x8D85;&#x51FA;&#x5355;&#x4E2A;&#x7ED3;&#x70B9;&#x786C;&#x4EF6;&#x9650;&#x5236;&#x7684;&#x5927;&#x91CF;&#x6570;&#x636E;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x5177;&#x6709;10&#x4EBF;&#x6587;&#x6863;&#x7684;&#x7D22;&#x5F15;&#x5360;&#x636E;1TB&#x7684;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#xFF0C;&#x800C;&#x4EFB;&#x4E00;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x6CA1;&#x6709;&#x8FD9;&#x6837;&#x5927;&#x7684;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x6765;&#x5B58;&#x50A8;&#x6216;&#x8005;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#x5904;&#x7406;&#x641C;&#x7D22;&#x8BF7;&#x6C42;&#xFF0C;&#x54CD;&#x5E94;&#x4F1A;&#x592A;&#x6162;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;Elasticsearch&#x63D0;&#x4F9B;&#x4E86;&#x5C06;&#x7D22;&#x5F15;&#x5212;&#x5206;&#x6210;&#x591A;&#x7247;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x8FD9;&#x4E9B;&#x7247;&#x53EB;&#x505A;&#x5206;&#x7247;&#x3002;&#x5F53;&#x4F60;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6307;&#x5B9A;&#x4F60;&#x60F3;&#x8981;&#x7684;&#x5206;&#x7247;&#x7684;&#x6570;&#x91CF;&#x3002;&#x6BCF;&#x4E2A;&#x5206;&#x7247;&#x672C;&#x8EAB;&#x4E5F;&#x662F;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x5B8C;&#x5584;&#x5E76;&#x4E14;&#x72EC;&#x7ACB;&#x7684;&#x201C;&#x7D22;&#x5F15;&#x201D;&#xFF0C;&#x8FD9;&#x4E2A;&#x201C;&#x7D22;&#x5F15;&#x201D; &#x53EF;&#x4EE5;&#x88AB;&#x653E;&#x7F6E;&#x5230;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x8282;&#x70B9;&#x4E0A;&#x3002;</p>
<p>&#x5206;&#x7247;&#x4E4B;&#x6240;&#x4EE5;&#x91CD;&#x8981;&#xFF0C;&#x4E3B;&#x8981;&#x6709;&#x4E24;&#x65B9;&#x9762;&#x7684;&#x539F;&#x56E0;&#xFF1A;</p>
<ul>
<li>&#x5141;&#x8BB8;&#x4F60;&#x6C34;&#x5E73;&#x5206;&#x5272;/&#x6269;&#x5C55;&#x4F60;&#x7684;&#x5185;&#x5BB9;&#x5BB9;&#x91CF;</li>
<li>&#x5141;&#x8BB8;&#x4F60;&#x5728;&#x5206;&#x7247;&#xFF08;&#x4F4D;&#x4E8E;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x4E0A;&#xFF09;&#x4E4B;&#x4E0A;&#x8FDB;&#x884C;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x3001;&#x5E76;&#x884C;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x8FDB;&#x800C;&#x63D0;&#x9AD8;&#x6027;&#x80FD;/&#x541E;&#x5410;&#x91CF;</li>
</ul>
<p>&#x81F3;&#x4E8E;&#x4E00;&#x4E2A;&#x5206;&#x7247;&#x600E;&#x6837;&#x5206;&#x5E03;&#xFF0C;&#x5B83;&#x7684;&#x6587;&#x6863;&#x600E;&#x6837;&#x805A;&#x5408;&#x56DE;&#x641C;&#x7D22;&#x8BF7;&#x6C42;&#xFF0C;&#x662F;&#x5B8C;&#x5168;&#x7531;Elasticsearch&#x7BA1;&#x7406;&#x7684;&#xFF0C;&#x5BF9;&#x4E8E;&#x4F5C;&#x4E3A;&#x7528;&#x6237;&#x7684;&#x4F60;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x900F;&#x660E;&#x7684;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;/&#x4E91;&#x7684;&#x73AF;&#x5883;&#x91CC;&#xFF0C;&#x5931;&#x8D25;&#x968F;&#x65F6;&#x90FD;&#x53EF;&#x80FD;&#x53D1;&#x751F;&#x3002;&#x5728;&#x67D0;&#x4E2A;&#x5206;&#x7247;/&#x8282;&#x70B9;&#x56E0;&#x4E3A;&#x67D0;&#x4E9B;&#x539F;&#x56E0;&#x5904;&#x4E8E;&#x79BB;&#x7EBF;&#x72B6;&#x6001;&#x6216;&#x8005;&#x6D88;&#x5931;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6545;&#x969C;&#x8F6C;&#x79FB;&#x673A;&#x5236;&#x662F;&#x975E;&#x5E38;&#x6709;&#x7528;&#x4E14;&#x5F3A;&#x70C8;&#x63A8;&#x8350;&#x7684;&#x3002;&#x4E3A;&#x6B64;&#xFF0C; Elasticsearch&#x5141;&#x8BB8;&#x4F60;&#x521B;&#x5EFA;&#x5206;&#x7247;&#x7684;&#x4E00;&#x4EFD;&#x6216;&#x591A;&#x4EFD;&#x62F7;&#x8D1D;&#xFF0C;&#x8FD9;&#x4E9B;&#x62F7;&#x8D1D;&#x53EB;&#x505A;&#x590D;&#x5236;&#x5206;&#x7247;&#xFF0C;&#x6216;&#x8005;&#x76F4;&#x63A5;&#x53EB;&#x590D;&#x5236;&#x3002;</p>
<p>&#x590D;&#x5236;&#x4E4B;&#x6240;&#x4EE5;&#x91CD;&#x8981;&#xFF0C;&#x6709;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x539F;&#x56E0;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x5206;&#x7247;/&#x8282;&#x70B9;&#x5931;&#x8D25;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x590D;&#x5236;&#x63D0;&#x4F9B;&#x4E86;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x3002;&#x590D;&#x5236;&#x5206;&#x7247;&#x4E0D;&#x4E0E;&#x539F;/&#x4E3B;&#x8981;&#x5206;&#x7247;&#x7F6E;&#x4E8E;&#x540C;&#x4E00;&#x8282;&#x70B9;&#x4E0A;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;</li>
<li>&#x56E0;&#x4E3A;&#x641C;&#x7D22;&#x53EF;&#x4EE5;&#x5728;&#x6240;&#x6709;&#x7684;&#x590D;&#x5236;&#x4E0A;&#x5E76;&#x884C;&#x8FD0;&#x884C;&#xFF0C;&#x590D;&#x5236;&#x53EF;&#x4EE5;&#x6269;&#x5C55;&#x4F60;&#x7684;&#x641C;&#x7D22;&#x91CF;/&#x541E;&#x5410;&#x91CF;</li>
</ul>
<p>&#x603B;&#x4E4B;&#xFF0C;&#x6BCF;&#x4E2A;&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x88AB;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x5206;&#x7247;&#x3002;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x4E5F;&#x53EF;&#x4EE5;&#x88AB;&#x590D;&#x5236;0&#x6B21;&#xFF08;&#x5373;&#x6CA1;&#x6709;&#x590D;&#x5236;&#xFF09; &#x6216;&#x591A;&#x6B21;&#x3002;&#x4E00;&#x65E6;&#x590D;&#x5236;&#x4E86;&#xFF0C;&#x6BCF;&#x4E2A;&#x7D22;&#x5F15;&#x5C31;&#x6709;&#x4E86;&#x4E3B;&#x5206;&#x7247;&#xFF08;&#x4F5C;&#x4E3A;&#x590D;&#x5236;&#x6E90;&#x7684;&#x5206;&#x7247;&#xFF09;&#x548C;&#x590D;&#x5236;&#x5206;&#x7247;&#xFF08;&#x4E3B;&#x5206;&#x7247;&#x7684;&#x62F7;&#x8D1D;&#xFF09;&#x3002; &#x5206;&#x7247;&#x548C;&#x590D;&#x5236;&#x7684;&#x6570;&#x91CF;&#x53EF;&#x4EE5;&#x5728;&#x7D22;&#x5F15;&#x521B;&#x5EFA;&#x7684;&#x65F6;&#x5019;&#x6307;&#x5B9A;&#x3002;&#x5728;&#x7D22;&#x5F15;&#x521B;&#x5EFA;&#x4E4B;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x52A8;&#x6001;&#x5730;&#x6539;&#x53D8;&#x590D;&#x5236;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x4E0D;&#x80FD;&#x518D;&#x6539;&#x53D8;&#x5206;&#x7247;&#x7684;&#x6570;&#x91CF;&#x3002;</p>
<p>&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Elasticsearch&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x7D22;&#x5F15;&#x5206;&#x914D;5&#x4E2A;&#x4E3B;&#x5206;&#x7247;&#x548C;1&#x4E2A;&#x590D;&#x5236;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7684;&#x96C6;&#x7FA4;&#x4E2D;&#x81F3;&#x5C11;&#x6709;&#x4E24;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x4F60;&#x7684;&#x7D22;&#x5F15;&#x5C06;&#x4F1A;&#x6709;5&#x4E2A;&#x4E3B;&#x5206;&#x7247;&#x548C;&#x53E6;&#x5916;5&#x4E2A;&#x590D;&#x5236;&#x5206;&#x7247;&#xFF08;1&#x4E2A;&#x5B8C;&#x5168;&#x62F7;&#x8D1D;&#xFF09;&#xFF0C;&#x8FD9;&#x6837;&#x6BCF;&#x4E2A;&#x7D22;&#x5F15;&#x603B;&#x5171;&#x5C31;&#x6709;10&#x4E2A;&#x5206;&#x7247;&#x3002;</p>
<h2 id="rest-&#x63A5;&#x53E3;">rest &#x63A5;&#x53E3;</h2>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x4E2A;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x7684;&#x8282;&#x70B9;&#xFF08;&#x548C;&#x96C6;&#x7FA4;&#xFF09;&#xFF0C;&#x4E0B;&#x4E00;&#x6B65;&#x5C31;&#x662F;&#x8981;&#x53BB;&#x7406;&#x89E3;&#x600E;&#x6837;&#x4E0E;&#x5176;&#x901A;&#x4FE1;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;Elasticsearch&#x63D0;&#x4F9B;&#x4E86;&#x975E;&#x5E38;&#x5168;&#x9762;&#x548C;&#x5F3A;&#x5927;&#x7684;REST API&#xFF0C;&#x5229;&#x7528;&#x8FD9;&#x4E2A;REST API&#x4F60;&#x53EF;&#x4EE5;&#x540C;&#x4F60;&#x7684;&#x96C6;&#x7FA4;&#x4EA4;&#x4E92;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x5229;&#x7528;&#x8FD9;&#x4E2A;API&#xFF0C;&#x53EF;&#x4EE5;&#x505A;&#x7684;&#x51E0;&#x4EF6;&#x4E8B;&#x60C5;&#xFF1A;</p>
<ul>
<li>&#x67E5;&#x4F60;&#x7684;&#x96C6;&#x7FA4;&#x3001;&#x8282;&#x70B9;&#x548C;&#x7D22;&#x5F15;&#x7684;&#x5065;&#x5EB7;&#x72B6;&#x6001;&#x548C;&#x5404;&#x79CD;&#x7EDF;&#x8BA1;&#x4FE1;&#x606F;</li>
<li>&#x7BA1;&#x7406;&#x4F60;&#x7684;&#x96C6;&#x7FA4;&#x3001;&#x8282;&#x70B9;&#x3001;&#x7D22;&#x5F15;&#x6570;&#x636E;&#x548C;&#x5143;&#x6570;&#x636E;</li>
<li>&#x5BF9;&#x4F60;&#x7684;&#x7D22;&#x5F15;&#x8FDB;&#x884C; CRUD&#xFF08;&#x521B;&#x5EFA;&#x3001;&#x8BFB;&#x53D6;&#x3001;&#x66F4;&#x65B0;&#x548C;&#x5220;&#x9664;&#xFF09;&#x548C;&#x641C;&#x7D22;&#x64CD;&#x4F5C;</li>
<li>&#x6267;&#x884C;&#x9AD8;&#x7EA7;&#x7684;&#x67E5;&#x8BE2;&#x64CD;&#x4F5C;&#xFF0C; &#x50CF;&#x662F;&#x5206;&#x9875;&#x3001;&#x6392;&#x5E8F;&#x3001;&#x8FC7;&#x6EE4;&#x3001;&#x811A;&#x672C;&#x7F16;&#x5199;&#xFF08;scripting&#xFF09;&#x3001;&#x5C0F;&#x5E73;&#x9762;&#x523B;&#x753B;&#xFF08;faceting&#xFF09;&#x3001;&#x805A;&#x5408;&#xFF08;aggregations&#xFF09;&#x548C;&#x8BB8;&#x591A;&#x5176;&#x5B83;&#x64CD;&#x4F5C;</li>
</ul>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x67E5;&#x770B;<strong>&#x96C6;&#x7FA4;&#x5065;&#x5EB7;(cluster health)</strong></p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x4EE5;&#x57FA;&#x672C;&#x7684;&#x5065;&#x5EB7;&#x68C0;&#x67E5;&#x4F5C;&#x4E3A;&#x5F00;&#x59CB;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x5B83;&#x6765;&#x67E5;&#x770B;&#x6211;&#x4EEC;&#x96C6;&#x7FA4;&#x7684;&#x72B6;&#x6001;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;curl&#xFF0C;&#x5F53;&#x7136;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;HTTP/REST&#x8C03;&#x7528;&#x7684;&#x5DE5;&#x5177;&#xFF0C;&#x6765;&#x4F7F;&#x7528;&#x8BE5;&#x529F;&#x80FD;&#x3002; &#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x6211;&#x4EEC;&#x8FD8;&#x5728;&#x6211;&#x4EEC;&#x542F;&#x52A8;Elasticsearch&#x7684;&#x8282;&#x70B9;&#x4E0A;&#x5E76;&#x6253;&#x5F00;&#x53E6;&#x5916;&#x4E00;&#x4E2A;shell&#x7A97;&#x53E3;&#x3002;</p>
<p>&#x8981;&#x68C0;&#x67E5;&#x96C6;&#x7FA4;&#x5065;&#x5EB7;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;_cat API&#xFF1A;</p>
<pre><code>curl &apos;localhost:9200/_cat/health?v&apos;
</code></pre><p>&#x76F8;&#x5E94;&#x7684;&#x54CD;&#x5E94;&#x662F;&#xFF1A;</p>
<pre><code>epoch timestamp cluster status node.total node.data shards pri relo init unassign1394735289 14:28:09 elasticsearch green 1 1 0 0 0 0 0
</code></pre><p>&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x6211;&#x4EEC;&#x96C6;&#x7FA4;&#x7684;&#x540D;&#x5B57;&#x662F;&#x201C;elasticsearch&#x201D;&#xFF0C;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x4E14;&#x72B6;&#x6001;&#x662F;&#x7EFF;&#x8272;&#x3002;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x67E5;&#x770B;&#x96C6;&#x7FA4;&#x72B6;&#x6001;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x5F97;&#x5230;&#x7EFF;&#x8272;&#x3001;&#x9EC4;&#x8272;&#x6216;&#x7EA2;&#x8272;&#x4E09;&#x79CD;&#x72B6;&#x6001;&#x3002;</p>
<ul>
<li>&#x7EFF;&#x8272;&#x4EE3;&#x8868;&#x4E00;&#x5207;&#x6B63;&#x5E38;&#xFF08;&#x96C6;&#x7FA4;&#x529F;&#x80FD;&#x9F50;&#x5168;&#xFF09;&#xFF1B;</li>
<li>&#x9EC4;&#x8272;&#x610F;&#x5473;&#x7740;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x90FD;&#x662F;&#x53EF;&#x7528;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x67D0;&#x4E9B;&#x590D;&#x5236;&#x6CA1;&#x6709;&#x88AB;&#x5206;&#x914D;&#xFF08;&#x96C6;&#x7FA4;&#x529F;&#x80FD;&#x9F50;&#x5168;&#xFF09;&#xFF1B;</li>
<li>&#x7EA2;&#x8272;&#x5219;&#x4EE3;&#x8868;&#x56E0;&#x4E3A;&#x67D0;&#x4E9B;&#x539F;&#x56E0;&#xFF0C;&#x67D0;&#x4E9B;&#x6570;&#x636E;&#x4E0D;&#x53EF;&#x7528;&#x3002;</li>
</ul>
<p>&#x6CE8;&#x610F;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x96C6;&#x7FA4;&#x72B6;&#x6001;&#x662F;&#x7EA2;&#x8272;&#x7684;&#xFF0C;&#x96C6;&#x7FA4;&#x4ECD;&#x7136;&#x662F;&#x90E8;&#x5206;&#x53EF;&#x7528;&#x7684;&#xFF08;&#x5B83;&#x4ECD;&#x7136;&#x4F1A;&#x5229;&#x7528;&#x53EF;&#x7528;&#x7684;&#x5206;&#x7247;&#x6765;&#x54CD;&#x5E94;&#x641C;&#x7D22;&#x8BF7;&#x6C42;&#xFF09;&#xFF0C;&#x4F46;&#x662F;&#x53EF;&#x80FD;&#x4F60;&#x9700;&#x8981;&#x5C3D;&#x5FEB;&#x4FEE;&#x590D;&#x5B83;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x6709;&#x4E22;&#x5931;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x4ECE;&#x4E0A;&#x9762;&#x7684;&#x54CD;&#x5E94;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230; &#x4E00;&#x5171;&#x6709;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x7531;&#x4E8E;&#x91CC;&#x9762;&#x6CA1;&#x6709;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x6709;0&#x4E2A;&#x5206;&#x7247;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x9ED8;&#x8BA4;&#x7684;&#x96C6;&#x7FA4;&#x540D;&#x5B57;&#xFF08;elasticsearch&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x7531;&#x4E8E;Elasticsearch&#x9ED8;&#x8BA4;&#x4F7F;&#x7528;&#x7F51;&#x7EDC;&#x591A;&#x64AD;&#xFF08;multicast&#xFF09;&#x53D1;&#x73B0;&#x5176;&#x5B83;&#x8282;&#x70B9;&#xFF0C; &#x5982;&#x679C;&#x4F60;&#x5728;&#x4F60;&#x7684;&#x7F51;&#x7EDC;&#x4E2D;&#x542F;&#x52A8;&#x4E86;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#xFF0C; &#x4F60;&#x5C31;&#x5DF2;&#x7ECF;&#x628A;&#x5B83;&#x4EEC;&#x52A0;&#x5165;&#x5230;&#x96C6;&#x7FA4;&#x4E2D;&#x4E86;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x5F62;&#x4E0B;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x5728;&#x4E0A;&#x9762;&#x7684;&#x54CD;&#x5E94;&#x4E2D;&#x770B;&#x5230;&#x591A;&#x4E2A;&#x8282;&#x70B9;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x8282;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x8282;&#x70B9;&#x5217;&#x8868;&#xFF1A;</p>
<pre><code>curl &apos;localhost:9200/_cat/nodes?v&apos;
</code></pre><p>&#x5BF9;&#x5E94;&#x7684;&#x54CD;&#x5E94;&#x662F;:</p>
<pre><code>curl &apos;localhost:9200/_cat/nodes?v&apos;host ip heap.percent ram.percent load node.role master namemwubuntu1 127.0.1.1 8 4 0.00 d * New Goblin
</code></pre><p>&#x8FD9;&#x513F;&#xFF0C; &#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x53EB;&#x201C;New Goblin&#x201D;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x8FD9;&#x4E2A;&#x8282;&#x70B9;&#x662F;&#x6211;&#x4EEC;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x552F;&#x4E00;&#x8282;&#x70B9;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../chapter1/section1.3.html" class="navigation navigation-prev " aria-label="Previous page: 集群搭建">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="chapter2.1.html" class="navigation navigation-next " aria-label="Next page: 基本的增删改查操作">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"elasticsearch基础","level":"1.3","depth":1,"next":{"title":"基本的增删改查操作","level":"1.3.1","depth":2,"path":"chapter2/chapter2.1.md","ref":"chapter2/chapter2.1.md","articles":[]},"previous":{"title":"集群搭建","level":"1.2.3","depth":2,"path":"chapter1/section1.3.md","ref":"chapter1/section1.3.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter2/section1.md","mtime":"2018-12-10T11:01:23.119Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-17T07:31:29.681Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

