
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>分布式搜索 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="section1.html" />
    
    
    <link rel="prev" href="section1.3.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../chapter1/section1.html">
            
                <a href="../chapter1/section1.html">
            
                    
                    安装
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../chapter1/section1.1.html">
            
                <a href="../chapter1/section1.1.html">
            
                    
                    linux安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../chapter1/section1.2.html">
            
                <a href="../chapter1/section1.2.html">
            
                    
                    docker安装
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../chapter1/section1.3.html">
            
                <a href="../chapter1/section1.3.html">
            
                    
                    集群搭建
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../chapter2/section1.html">
            
                <a href="../chapter2/section1.html">
            
                    
                    elasticsearch基础
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="../chapter2/chapter2.1.html">
            
                <a href="../chapter2/chapter2.1.html">
            
                    
                    基本的增删改查操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../chapter2/section2.2.html">
            
                <a href="../chapter2/section2.2.html">
            
                    
                    query操作
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../chapter2/section2.3.html">
            
                <a href="../chapter2/section2.3.html">
            
                    
                    索引管理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../chapter2/section2.4.html">
            
                <a href="../chapter2/section2.4.html">
            
                    
                    聚合
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../chapter4/section1.html">
            
                <a href="../chapter4/section1.html">
            
                    
                    elasticsearch内部机制
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="section1.2.html">
            
                <a href="section1.2.html">
            
                    
                    映射
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../chapter4/chapter4.1.html">
            
                <a href="../chapter4/chapter4.1.html">
            
                    
                    倒排索引
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.3" data-path="section1.3.html">
            
                <a href="section1.3.html">
            
                    
                    复合字段
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4.4" data-path="section1.4.html">
            
                <a href="section1.4.html">
            
                    
                    分布式搜索
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="section1.html">
            
                <a href="section1.html">
            
                    
                    logstash实践
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="section1.1.html">
            
                <a href="section1.1.html">
            
                    
                    基础知识
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >分布式搜索</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x5206;&#x5E03;&#x5F0F;&#x641C;&#x7D22;">&#x5206;&#x5E03;&#x5F0F;&#x641C;&#x7D22;</h1>
<p>&#x641C;&#x7D22;&#x662F;&#x5982;&#x4F55;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x73AF;&#x5883;&#x4E2D;&#x6267;&#x884C;&#x7684;?  &#x5B83;&#x6BD4;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x8BB2;&#x7684;&#x57FA;&#x7840;&#x7684;<em>&#x589E;&#x5220;&#x6539;&#x67E5;</em>(<em>create-read-update-delete</em> &#xFF0C;CRUD)&#x8BF7;&#x6C42;&#x8981;&#x590D;&#x6742;&#x4E00;&#x4E9B;&#x3002;</p>
<blockquote>
<h4 id="&#x6CE8;&#x610F;&#xFF1A;">&#x6CE8;&#x610F;&#xFF1A;</h4>
<p>&#x672C;&#x7AE0;&#x7684;&#x4FE1;&#x606F;&#x53EA;&#x662F;&#x51FA;&#x4E8E;&#x5174;&#x8DA3;&#x9605;&#x8BFB;&#xFF0C;&#x4F7F;&#x7528;Elasticsearch&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x7406;&#x89E3;&#x548C;&#x8BB0;&#x4F4F;&#x8FD9;&#x91CC;&#x7684;&#x6240;&#x6709;&#x7EC6;&#x8282;&#x3002;</p>
<p>&#x9605;&#x8BFB;&#x8FD9;&#x4E00;&#x8282;&#x53EA;&#x662F;&#x589E;&#x52A0;&#x5BF9;&#x7CFB;&#x7EDF;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x4E86;&#x89E3;&#xFF0C;&#x5E76;&#x8BA9;&#x4F60;&#x77E5;&#x9053;&#x8FD9;&#x4E9B;&#x4FE1;&#x606F;&#x4EE5;&#x5907;&#x4EE5;&#x540E;&#x53C2;&#x8003;&#xFF0C;&#x6240;&#x4EE5;&#x522B;&#x6DF9;&#x6CA1;&#x5728;&#x7EC6;&#x8282;&#x91CC;&#x3002;</p>
</blockquote>
<p>&#x4E00;&#x4E2A;CRUD&#x64CD;&#x4F5C;&#x53EA;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6587;&#x6863;&#x3002;&#x6587;&#x6863;&#x7684;&#x552F;&#x4E00;&#x6027;&#x7531;<code>_index</code>, <code>_type</code>&#x548C;<code>routing-value</code>&#xFF08;&#x901A;&#x5E38;&#x9ED8;&#x8BA4;&#x662F;&#x8BE5;&#x6587;&#x6863;&#x7684;<code>_id</code>&#xFF09;&#x7684;&#x7EC4;&#x5408;&#x6765;&#x786E;&#x5B9A;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x51C6;&#x786E;&#x77E5;&#x9053;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x54EA;&#x4E2A;&#x5206;&#x7247;&#x6301;&#x6709;&#x8FD9;&#x4E2A;&#x6587;&#x6863;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x4E0D;&#x77E5;&#x9053;&#x54EA;&#x4E2A;&#x6587;&#x6863;&#x4F1A;&#x5339;&#x914D;&#x67E5;&#x8BE2;&#xFF08;&#x6587;&#x6863;&#x53EF;&#x80FD;&#x5B58;&#x653E;&#x5728;&#x96C6;&#x7FA4;&#x4E2D;&#x7684;&#x4EFB;&#x610F;&#x5206;&#x7247;&#x4E0A;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x641C;&#x7D22;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x66F4;&#x590D;&#x6742;&#x7684;&#x6A21;&#x578B;&#x3002;&#x4E00;&#x4E2A;&#x641C;&#x7D22;&#x4E0D;&#x5F97;&#x4E0D;&#x901A;&#x8FC7;&#x67E5;&#x8BE2;&#x6BCF;&#x4E00;&#x4E2A;&#x6211;&#x4EEC;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x7D22;&#x5F15;&#x7684;&#x5206;&#x7247;&#x526F;&#x672C;&#xFF0C;&#x6765;&#x770B;&#x662F;&#x5426;&#x542B;&#x6709;&#x4EFB;&#x4F55;&#x5339;&#x914D;&#x7684;&#x6587;&#x6863;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x627E;&#x5230;&#x6240;&#x6709;&#x5339;&#x914D;&#x7684;&#x6587;&#x6863;&#x53EA;&#x5B8C;&#x6210;&#x4E86;&#x8FD9;&#x4EF6;&#x4E8B;&#x7684;&#x4E00;&#x534A;&#x3002;&#x5728;&#x641C;&#x7D22;&#xFF08;<code>search</code>&#xFF09;API&#x8FD4;&#x56DE;&#x4E00;&#x9875;&#x7ED3;&#x679C;&#x524D;&#xFF0C;&#x6765;&#x81EA;&#x591A;&#x4E2A;&#x5206;&#x7247;&#x7684;&#x7ED3;&#x679C;&#x5FC5;&#x987B;&#x88AB;&#x7EC4;&#x5408;&#x653E;&#x5230;&#x4E00;&#x4E2A;&#x6709;&#x5E8F;&#x5217;&#x8868;&#x4E2D;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x641C;&#x7D22;&#x7684;&#x6267;&#x884C;&#x8FC7;&#x7A0B;&#x5206;&#x4E24;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x79F0;&#x4E3A;<em>&#x67E5;&#x8BE2;&#x7136;&#x540E;&#x53D6;&#x56DE;</em>&#xFF08;<em>query then fetch</em>&#xFF09;&#x3002;</p>
<h2 id="&#x67E5;&#x8BE2;&#x9636;&#x6BB5;">&#x67E5;&#x8BE2;&#x9636;&#x6BB5;</h2>
<p>&#x5728;&#x521D;&#x59CB;&#x5316;<em>&#x67E5;&#x8BE2;&#x9636;&#x6BB5;</em>&#xFF08;<em>query phase</em>&#xFF09;&#xFF0C;&#x67E5;&#x8BE2;&#x88AB;&#x5411;&#x7D22;&#x5F15;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5206;&#x7247;&#x526F;&#x672C;&#xFF08;&#x539F;&#x672C;&#x6216;&#x526F;&#x672C;&#xFF09;&#x5E7F;&#x64AD;&#x3002;&#x6BCF;&#x4E2A;&#x5206;&#x7247;&#x5728;&#x672C;&#x5730;&#x6267;&#x884C;&#x641C;&#x7D22;&#x5E76;&#x4E14;&#x5EFA;&#x7ACB;&#x4E86;&#x5339;&#x914D;document&#x7684;<em>&#x4F18;&#x5148;&#x961F;&#x5217;</em>&#xFF08;<em>priority queue</em>&#xFF09;&#x3002;</p>
<blockquote>
<h4 id="&#x4F18;&#x5148;&#x961F;&#x5217;">&#x4F18;&#x5148;&#x961F;&#x5217;</h4>
<p>&#x4E00;&#x4E2A;<em>&#x4F18;&#x5148;&#x961F;&#x5217;</em>&#xFF08;<em>priority queue</em> is&#xFF09;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5B58;&#x6709;<em>&#x524D;n&#x4E2A;</em>&#xFF08;<em>top-n</em>&#xFF09;&#x5339;&#x914D;document&#x7684;&#x6709;&#x5E8F;&#x5217;&#x8868;&#x3002;&#x8FD9;&#x4E2A;&#x4F18;&#x5148;&#x961F;&#x5217;&#x7684;&#x5927;&#x5C0F;&#x7531;&#x5206;&#x9875;&#x53C2;&#x6570;from&#x548C;size&#x51B3;&#x5B9A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0B;&#x9762;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x7684;&#x641C;&#x7D22;&#x8BF7;&#x6C42;&#x8981;&#x6C42;&#x4F18;&#x5148;&#x961F;&#x5217;&#x8981;&#x80FD;&#x591F;&#x5BB9;&#x7EB3;100&#x4E2A;document</p>
</blockquote>
<pre><code class="lang-JavaScript">GET /_search
{
    <span class="hljs-string">&quot;from&quot;</span>: <span class="hljs-number">90</span>,
    <span class="hljs-string">&quot;size&quot;</span>: <span class="hljs-number">10</span>
}
</code></pre>
<p>&#x8FD9;&#x4E2A;&#x67E5;&#x8BE2;&#x7684;&#x8FC7;&#x7A0B;&#x88AB;&#x63CF;&#x8FF0;&#x5728;&#x56FE;&#x5206;&#x5E03;&#x5F0F;&#x641C;&#x7D22;&#x67E5;&#x8BE2;&#x9636;&#x6BB5;&#x4E2D;&#x3002;</p>
<p><img src="https://ws4.sinaimg.cn/large/006tNbRwgy1fy2nmji5azj30ku09daan.jpg" alt="Query phase of distributed search"></p>
<p>&#x56FE;1 &#x5206;&#x5E03;&#x5F0F;&#x641C;&#x7D22;&#x67E5;&#x8BE2;&#x9636;&#x6BB5;</p>
<p>&#x67E5;&#x8BE2;&#x9636;&#x6BB5;&#x5305;&#x542B;&#x4EE5;&#x4E0B;&#x4E09;&#x6B65;&#xFF1A;</p>
<p>1.&#x5BA2;&#x6237;&#x7AEF;&#x53D1;&#x9001;&#x4E00;&#x4E2A;<code>search&#xFF08;&#x641C;&#x7D22;&#xFF09;</code>&#x8BF7;&#x6C42;&#x7ED9;<code>Node 3</code>,<code>Node 3</code>&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;<code>from+size</code>&#x7684;&#x7A7A;&#x4F18;&#x5148;&#x7EA7;&#x961F;&#x5217;&#x3002; 2.<code>Node 3</code> &#x8F6C;&#x53D1;&#x8FD9;&#x4E2A;&#x641C;&#x7D22;&#x8BF7;&#x6C42;&#x5230;&#x7D22;&#x5F15;&#x4E2D;&#x6BCF;&#x4E2A;&#x5206;&#x7247;&#x7684;&#x539F;&#x672C;&#x6216;&#x526F;&#x672C;&#x3002;&#x6BCF;&#x4E2A;&#x5206;&#x7247;&#x5728;&#x672C;&#x5730;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x67E5;&#x8BE2;&#x5E76;&#x4E14;&#x7ED3;&#x679C;&#x5C06;&#x7ED3;&#x679C;&#x5230;&#x4E00;&#x4E2A;&#x5927;&#x5C0F;&#x4E3A;<code>from+size</code>&#x7684;&#x6709;&#x5E8F;&#x672C;&#x5730;&#x4F18;&#x5148;&#x961F;&#x5217;&#x91CC;&#x53BB;&#x3002; 3.&#x6BCF;&#x4E2A;&#x5206;&#x7247;&#x8FD4;&#x56DE;document&#x7684;ID&#x548C;&#x5B83;&#x4F18;&#x5148;&#x961F;&#x5217;&#x91CC;&#x7684;&#x6240;&#x6709;document&#x7684;&#x6392;&#x5E8F;&#x503C;&#x7ED9;&#x534F;&#x8C03;&#x8282;&#x70B9;<code>Node 3</code>&#x3002;<code>Node 3</code>&#x628A;&#x8FD9;&#x4E9B;&#x503C;&#x5408;&#x5E76;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x4F18;&#x5148;&#x961F;&#x5217;&#x91CC;&#x4EA7;&#x751F;&#x5168;&#x5C40;&#x6392;&#x5E8F;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x641C;&#x7D22;&#x8BF7;&#x6C42;&#x88AB;&#x53D1;&#x9001;&#x5230;&#x4E00;&#x4E2A;&#x8282;&#x70B9;Node&#xFF0C;&#x8FD9;&#x4E2A;&#x8282;&#x70B9;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x534F;&#x8C03;&#x8282;&#x70B9;&#x3002;&#x8FD9;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x5411;&#x6240;&#x6709;&#x76F8;&#x5173;&#x7684;&#x5206;&#x7247;&#x5E7F;&#x64AD;&#x641C;&#x7D22;&#x8BF7;&#x6C42;&#x5E76;&#x4E14;&#x628A;&#x5B83;&#x4EEC;&#x7684;&#x54CD;&#x5E94;&#x6574;&#x5408;&#x6210;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x7684;&#x6709;&#x5E8F;&#x7ED3;&#x679C;&#x96C6;&#x3002;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x96C6;&#x4F1A;&#x88AB;&#x8FD4;&#x56DE;&#x7ED9;&#x5BA2;&#x6237;&#x7AEF;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x5411;&#x7D22;&#x5F15;&#x91CC;&#x7684;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x5206;&#x7247;&#x526F;&#x672C;&#x5E7F;&#x64AD;&#x8BF7;&#x6C42;&#x3002;&#x5C31;&#x50CF;document&#x7684;<code>GET</code>&#x8BF7;&#x6C42;&#x4E00;&#x6837;&#xFF0C;&#x641C;&#x7D22;&#x8BF7;&#x6C42;&#x53EF;&#x4EE5;&#x88AB;&#x6BCF;&#x4E2A;&#x5206;&#x7247;&#x7684;&#x539F;&#x672C;&#x6216;&#x4EFB;&#x610F;&#x526F;&#x672C;&#x5904;&#x7406;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x66F4;&#x591A;&#x7684;&#x526F;&#x672C;&#xFF08;&#x5F53;&#x7ED3;&#x5408;&#x66F4;&#x591A;&#x7684;&#x786C;&#x4EF6;&#x65F6;&#xFF09;&#x5982;&#x4F55;&#x63D0;&#x9AD8;&#x641C;&#x7D22;&#x7684;&#x541E;&#x5410;&#x91CF;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5BF9;&#x4E8E;&#x540E;&#x7EED;&#x8BF7;&#x6C42;&#xFF0C;&#x534F;&#x8C03;&#x8282;&#x70B9;&#x4F1A;&#x8F6E;&#x8BE2;&#x6240;&#x6709;&#x7684;&#x5206;&#x7247;&#x526F;&#x672C;&#x4EE5;&#x5206;&#x644A;&#x8D1F;&#x8F7D;&#x3002;</p>
<p>&#x6BCF;&#x4E00;&#x4E2A;&#x5206;&#x7247;&#x5728;&#x672C;&#x5730;&#x6267;&#x884C;&#x67E5;&#x8BE2;&#x548C;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;<code>from+size</code>&#x7684;&#x6709;&#x5E8F;&#x4F18;&#x5148;&#x961F;&#x5217;&#x2014;&#x2014;&#x8FD9;&#x4E2A;&#x957F;&#x5EA6;&#x610F;&#x5473;&#x7740;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x7ED3;&#x679C;&#x6570;&#x91CF;&#x5C31;&#x8DB3;&#x591F;&#x6EE1;&#x8DB3;&#x5168;&#x5C40;&#x7684;&#x8BF7;&#x6C42;&#x8981;&#x6C42;&#x3002;&#x5206;&#x7247;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x7ED3;&#x679C;&#x5217;&#x8868;&#x7ED9;&#x534F;&#x8C03;&#x8282;&#x70B9;&#x3002;&#x53EA;&#x5305;&#x542B;documentID&#x503C;&#x548C;&#x6392;&#x5E8F;&#x9700;&#x8981;&#x7528;&#x5230;&#x7684;&#x503C;&#xFF0C;&#x4F8B;&#x5982;<code>_score</code>&#x3002;</p>
<p>&#x534F;&#x8C03;&#x8282;&#x70B9;&#x5C06;&#x8FD9;&#x4E9B;&#x5206;&#x7247;&#x7EA7;&#x7684;&#x7ED3;&#x679C;&#x5408;&#x5E76;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x6709;&#x5E8F;&#x4F18;&#x5148;&#x961F;&#x5217;&#x91CC;&#x3002;&#x8FD9;&#x4E2A;&#x5C31;&#x4EE3;&#x8868;&#x4E86;&#x6700;&#x7EC8;&#x7684;&#x5168;&#x5C40;&#x6709;&#x5E8F;&#x7ED3;&#x679C;&#x96C6;&#x3002;&#x5230;&#x8FD9;&#x91CC;&#xFF0C;&#x67E5;&#x8BE2;&#x9636;&#x6BB5;&#x7ED3;&#x675F;&#x3002;</p>
<p>&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x7C7B;&#x4F3C;&#x4E8E;&#x5F52;&#x5E76;&#x6392;&#x5E8F;&#x7B97;&#x6CD5;&#xFF0C;&#x5148;&#x5206;&#x7EC4;&#x6392;&#x5E8F;&#x518D;&#x5F52;&#x5E76;&#x5230;&#x4E00;&#x8D77;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x5206;&#x5E03;&#x5F0F;&#x573A;&#x666F;&#x975E;&#x5E38;&#x9002;&#x7528;&#x3002;</p>
<blockquote>
<h3 id="&#x6CE8;&#x610F;">&#x6CE8;&#x610F;</h3>
<p>&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x7531;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x539F;&#x59CB;&#x5206;&#x7247;&#x7EC4;&#x6210;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x4E2A;&#x5BF9;&#x4E8E;&#x5355;&#x4E2A;&#x7D22;&#x5F15;&#x7684;&#x641C;&#x7D22;&#x8BF7;&#x6C42;&#x4E5F;&#x9700;&#x8981;&#x80FD;&#x591F;&#x628A;&#x6765;&#x81EA;&#x591A;&#x4E2A;&#x5206;&#x7247;&#x7684;&#x7ED3;&#x679C;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x3002;&#x4E00;&#x4E2A;&#x5BF9;&#x4E8E; <em>&#x591A;&#xFF08;multiple&#xFF09;</em>&#x6216;<em>&#x5168;&#x90E8;&#xFF08;all&#xFF09;</em>&#x7D22;&#x5F15;&#x7684;&#x641C;&#x7D22;&#x7684;&#x5DE5;&#x4F5C;&#x673A;&#x5236;&#x548C;&#x8FD9;&#x5B8C;&#x5168;&#x4E00;&#x81F4;&#x2014;&#x2014;&#x4EC5;&#x4EC5;&#x662F;&#x591A;&#x4E86;&#x4E00;&#x4E9B;&#x5206;&#x7247;&#x800C;&#x5DF2;&#x3002;</p>
</blockquote>
<h3 id="timeout&#xFF08;&#x8D85;&#x65F6;&#xFF09;">timeout&#xFF08;&#x8D85;&#x65F6;&#xFF09;</h3>
<p>&#x901A;&#x5E38;&#xFF0C;&#x534F;&#x8C03;&#x8282;&#x70B9;&#x4F1A;&#x7B49;&#x5F85;&#x63A5;&#x6536;&#x6240;&#x6709;&#x5206;&#x7247;&#x7684;&#x56DE;&#x7B54;&#x3002;&#x5982;&#x679C;&#x6709;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x9047;&#x5230;&#x95EE;&#x9898;&#xFF0C;&#x5B83;&#x4F1A;&#x62D6;&#x6162;&#x6574;&#x4E2A;&#x641C;&#x7D22;&#x8BF7;&#x6C42;&#x3002;</p>
<p><code>timeout</code>&#x53C2;&#x6570;&#x544A;&#x8BC9;&#x534F;&#x8C03;&#x8282;&#x70B9;&#x6700;&#x591A;&#x7B49;&#x5F85;&#x591A;&#x4E45;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x653E;&#x5F03;&#x7B49;&#x5F85;&#x800C;&#x5C06;&#x5DF2;&#x6709;&#x7ED3;&#x679C;&#x8FD4;&#x56DE;&#x3002;&#x8FD4;&#x56DE;&#x90E8;&#x5206;&#x7ED3;&#x679C;&#x603B;&#x6BD4;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x6709;&#x597D;&#x3002;</p>
<p>&#x641C;&#x7D22;&#x8BF7;&#x6C42;&#x7684;&#x8FD4;&#x56DE;&#x5C06;&#x4F1A;&#x6307;&#x51FA;&#x8FD9;&#x4E2A;&#x641C;&#x7D22;&#x662F;&#x5426;&#x8D85;&#x65F6;&#xFF0C;&#x4EE5;&#x53CA;&#x6709;&#x591A;&#x5C11;&#x5206;&#x7247;&#x6210;&#x529F;&#x7B54;&#x590D;&#x4E86;&#xFF1A;</p>
<pre><code class="lang-js">    ...
    <span class="hljs-string">&quot;timed_out&quot;</span>:     <span class="hljs-literal">true</span>,  (<span class="hljs-number">1</span>)
    <span class="hljs-string">&quot;_shards&quot;</span>: {
       <span class="hljs-string">&quot;total&quot;</span>:      <span class="hljs-number">5</span>,
       <span class="hljs-string">&quot;successful&quot;</span>: <span class="hljs-number">4</span>,
       <span class="hljs-string">&quot;failed&quot;</span>:     <span class="hljs-number">1</span>     (<span class="hljs-number">2</span>)
    },
    ...
</code></pre>
<p>(1) &#x641C;&#x7D22;&#x8BF7;&#x6C42;&#x8D85;&#x65F6;&#x3002;</p>
<p>(2) &#x4E94;&#x4E2A;&#x5206;&#x7247;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x6CA1;&#x5728;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#x5185;&#x7B54;&#x590D;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x5206;&#x7247;&#x7684;&#x6240;&#x6709;&#x526F;&#x672C;&#x90FD;&#x56E0;&#x4E3A;&#x5176;&#x4ED6;&#x539F;&#x56E0;&#x5931;&#x8D25;&#x4E86;&#x2014;&#x2014;&#x4E5F;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x786C;&#x4EF6;&#x6545;&#x969C;&#x2014;&#x2014;&#x8FD9;&#x4E2A;&#x4E5F;&#x540C;&#x6837;&#x4F1A;&#x53CD;&#x6620;&#x5728;&#x8BE5;&#x7B54;&#x590D;&#x7684;<code>_shards</code>&#x90E8;&#x5206;&#x91CC;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="section1.3.html" class="navigation navigation-prev " aria-label="Previous page: 复合字段">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="section1.html" class="navigation navigation-next " aria-label="Next page: logstash实践">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"分布式搜索","level":"1.4.4","depth":2,"next":{"title":"logstash实践","level":"1.5","depth":1,"path":"chapter3/section1.md","ref":"chapter3/section1.md","articles":[{"title":"基础知识","level":"1.5.1","depth":2,"path":"chapter3/section1.1.md","ref":"chapter3/section1.1.md","articles":[]}]},"previous":{"title":"复合字段","level":"1.4.3","depth":2,"path":"chapter3/section1.3.md","ref":"chapter3/section1.3.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter3/section1.4.md","mtime":"2018-12-11T03:40:48.480Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-11T09:22:17.438Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

